[{"stringId":"9606.ENSP00000340278","preferredName":"PARK7","taxonName":"Homo sapiens","queryIndex":0,"annotation":"Parkinson protein 7; Protein deglycase that repairs methylglyoxal- and glyoxal-glycated amino acids and proteins, and releases repaired proteins and lactate or glycolate, respectively. Deglycates cysteines, arginines and lysines residues in proteins, and thus reactivates these proteins by reversing glycation by glyoxals. Acts on early glycation intermediates (hemithioacetals and aminocarbinols), preventing the formation of advanced glycation endproducts (AGE) (PubMed:25416785). Plays an important role in cell protection against oxidative stress and cell death acting as oxidative stress [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000327214","preferredName":"ATP13A2","taxonName":"Homo sapiens","queryIndex":1,"annotation":"ATPase type 13A2; May play a role in intracellular cation homeostasis and the maintenance of neuronal integrity","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000260818","preferredName":"DNAJC13","taxonName":"Homo sapiens","queryIndex":10,"annotation":"DnaJ (Hsp40) homolog, subfamily C, member 13; Involved in membrane trafficking through early endosomes, such as the early endosome to recycling endosome transport implicated in the recycling of transferrin and the early endosome to late endosome transport implicated in degradation of EGF and EGFR (PubMed:18256511, PubMed:18307993). Involved in the regulation of endosomal membrane tubulation and regulates th dynamics of SNX1 on the endosomal membrane; via association with FAM21 may link the WASH complex to the retromer SNX-BAR subcomplex (PubMed:24643499)","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000338020","preferredName":"EIF4G1","taxonName":"Homo sapiens","queryIndex":11,"annotation":"Eukaryotic translation initiation factor 4 gamma, 1; Component of the protein complex eIF4F, which is involved in the recognition of the mRNA cap, ATP-dependent unwinding of 5'-terminal secondary structure and recruitment of mRNA to the ribosome","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000284440","preferredName":"UCHL1","taxonName":"Homo sapiens","queryIndex":12,"annotation":"Ubiquitin carboxyl-terminal esterase L1 (ubiquitin thiolesterase); Ubiquitin-protein hydrolase involved both in the processing of ubiquitin precursors and of ubiquitinated proteins. This enzyme is a thiol protease that recognizes and hydrolyzes a peptide bond at the C-terminal glycine of ubiquitin. Also binds to free monoubiquitin and may prevent its degradation in lysosomes. The homodimer may have ATP-independent ubiquitin ligase activity","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000338345","preferredName":"SNCA","taxonName":"Homo sapiens","queryIndex":13,"annotation":"Synuclein, alpha (non A4 component of amyloid precursor); May be involved in the regulation of dopamine release and transport. Induces fibrillization of microtubule-associated protein tau. Reduces neuronal responsiveness to various apoptotic stimuli, leading to a decreased caspase-3 activation","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000355865","preferredName":"PARK2","taxonName":"Homo sapiens","queryIndex":15,"annotation":"Parkinson protein 2, E3 ubiquitin protein ligase (parkin); Functions within a multiprotein E3 ubiquitin ligase complex, catalyzing the covalent attachment of ubiquitin moieties onto substrate proteins, such as BCL2, SYT11, CCNE1, GPR37, RHOT1/MIRO1, MFN1, MFN2, STUB1, SNCAIP, SEPT5, TOMM20, USP30, ZNF746 and AIMP2 (PubMed:10973942, PubMed:10888878, PubMed:11431533, PubMed:12150907, PubMed:12628165, PubMed:16135753, PubMed:21376232, PubMed:23754282, PubMed:23620051, PubMed:24660806, PubMed:24751536). Mediates monoubiquitination as well as 'Lys-6', 'Lys-11', 'Lys-48'-linked and 'Lys-63'- [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000230354","preferredName":"TBP","taxonName":"Homo sapiens","queryIndex":16,"annotation":"TATA box binding protein; General transcription factor that functions at the core of the DNA-binding multiprotein factor TFIID. Binding of TFIID to the TATA box is the initial transcriptional step of the pre- initiation complex (PIC), playing a role in the activation of eukaryotic genes transcribed by RNA polymerase II. Component of the transcription factor SL1/TIF-IB complex, which is involved in the assembly of the PIC (preinitiation complex) during RNA polymerase I-dependent transcription. The rate of PIC formation probably is primarily dependent on the rate of association of SL1 wi [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000378812","preferredName":"CHCHD2","taxonName":"Homo sapiens","queryIndex":17,"annotation":"Coiled-coil-helix-coiled-coil-helix domain containing 2; Transcription factor. Binds to the oxygen responsive element of COX4I2 and activates its transcription under hypoxia conditions (4% oxygen), as well as normoxia conditions (20% oxygen) (PubMed:23303788)","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000298910","preferredName":"LRRK2","taxonName":"Homo sapiens","queryIndex":18,"annotation":"Leucine-rich repeat kinase 2; Positively regulates autophagy through a calcium- dependent activation of the CaMKK/AMPK signaling pathway. The process involves activation of nicotinic acid adenine dinucleotide phosphate (NAADP) receptors, increase in lysosomal pH, and calcium release from lysosomes. Together with RAB29, plays a role in the retrograde trafficking pathway for recycling proteins, such as mannose 6 phosphate receptor (M6PR), between lysosomes and the Golgi apparatus in a retromer-dependent manner. Regulates neuronal process morphology in the intact central nervous system (C [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000366843","preferredName":"ATXN2","taxonName":"Homo sapiens","queryIndex":19,"annotation":"Ataxin 2; Involved in EGFR trafficking, acting as negative regulator of endocytic EGFR internalization at the plasma membrane","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000364204","preferredName":"PINK1","taxonName":"Homo sapiens","queryIndex":2,"annotation":"PTEN induced putative kinase 1; Protects against mitochondrial dysfunction during cellular stress by phosphorylating mitochondrial proteins. Involved in the clearance of damaged mitochondria via selective autophagy (mitophagy) by mediating activation and translocation of PARK2. Targets PARK2 to dysfunctional depolarized mitochondria through the phosphorylation of MFN2. Activates PARK2 in 2 steps: (1) by mediating phosphorylation at 'Ser-65' of PARK2 and (2) mediating phosphorylation of ubiquitin, converting PARK2 to its fully-active form (PubMed:24660806, PubMed:24751536, PubMed:247845 [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000261517","preferredName":"VPS13C","taxonName":"Homo sapiens","queryIndex":20,"annotation":"Vacuolar protein sorting 13 homolog C (S. cerevisiae)","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000299138","preferredName":"VPS35","taxonName":"Homo sapiens","queryIndex":21,"annotation":"Vacuolar protein sorting 35 homolog (S. cerevisiae); Acts as component of the retromer cargo-selective complex (CSC). The CSC is believed to be the core functional component of retromer or respective retromer complex variants acting to prevent missorting of selected transmembrane cargo proteins into the lysosomal degradation pathway. The recruitment of the CSC to the endosomal membrane involves RAB7A and SNX3. The CSC seems to associate with the cytoplasmic domain of cargo proteins predominantly via VPS35; however, these interactions seem to be of low affinity and retromer SNX proteins [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000340820","preferredName":"MAPT","taxonName":"Homo sapiens","queryIndex":22,"annotation":"Microtubule-associated protein tau; Promotes microtubule assembly and stability, and might be involved in the establishment and maintenance of neuronal polarity. The C-terminus binds axonal microtubules while the N- terminus binds neural plasma membrane components, suggesting that tau functions as a linker protein between both. Axonal polarity is predetermined by TAU/MAPT localization (in the neuronal cell) in the domain of the cell body defined by the centrosome. The short isoforms allow plasticity of the cytoskeleton whereas the longer isoforms may preferentially play a role in its s [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000409667","preferredName":"SYNJ1","taxonName":"Homo sapiens","queryIndex":23,"annotation":"Synaptojanin 1; Inositol 5-phosphatase which has a role in clathrin- mediated endocytosis","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000266087","preferredName":"FBXO7","taxonName":"Homo sapiens","queryIndex":24,"annotation":"F-box protein 7; Substrate recognition component of a SCF (SKP1-CUL1-F- box protein) E3 ubiquitin-protein ligase complex which mediates the ubiquitination and subsequent proteasomal degradation of target proteins. Recognizes BIRC2 and DLGAP5. Plays a role downstream of PINK1 in the clearance of damaged mitochondria via selective autophagy (mitophagy) by targeting PARK2 to dysfunctional depolarized mitochondria. Promotes MFN1 ubiquitination","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000333142","preferredName":"PLA2G6","taxonName":"Homo sapiens","queryIndex":25,"annotation":"Phospholipase A2, group VI (cytosolic, calcium-independent); Catalyzes the release of fatty acids from phospholipids. It has been implicated in normal phospholipid remodeling, nitric oxide-induced or vasopressin-induced arachidonic acid release and in leukotriene and prostaglandin production. May participate in fas mediated apoptosis and in regulating transmembrane ion flux in glucose-stimulated B-cells. Has a role in cardiolipin (CL) deacylation. Required for both speed and directionality of monocyte MCP1/CCL2-induced chemotaxis through regulation of F- actin polymerization at the pse [...] ","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000327589","preferredName":"GLUD2","taxonName":"Homo sapiens","queryIndex":27,"annotation":"Glutamate dehydrogenase 2; Important for recycling the chief excitatory neurotransmitter, glutamate, during neurotransmission","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000378735","preferredName":"DNAJC6","taxonName":"Homo sapiens","queryIndex":4,"annotation":"DnaJ (Hsp40) homolog, subfamily C, member 6; Recruits HSPA8/HSC70 to clathrin-coated vesicles and promotes uncoating of clathrin-coated vesicles. Plays a role in clathrin-mediated endocytosis in neurons (By similarity)","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000314508","preferredName":"GBA","taxonName":"Homo sapiens","queryIndex":5,"annotation":"Glucosidase, beta, acid","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000258080","preferredName":"HTRA2","taxonName":"Homo sapiens","queryIndex":8,"annotation":"HtrA serine peptidase 2; Serine protease that shows proteolytic activity against a non-specific substrate beta-casein. Promotes or induces cell death either by direct binding to and inhibition of BIRC proteins (also called inhibitor of apoptosis proteins, IAPs), leading to an increase in caspase activity, or by a BIRC inhibition-independent, caspase-independent and serine protease activity-dependent mechanism. Cleaves THAP5 and promotes its degradation during apoptosis. Isoform 2 seems to be proteolytically inactive","ncbiTaxonId":9606},{"stringId":"9606.ENSP00000387170","preferredName":"GIGYF2","taxonName":"Homo sapiens","queryIndex":9,"annotation":"GRB10 interacting GYF protein 2; May act cooperatively with GRB10 to regulate tyrosine kinase receptor signaling, including IGF1 and insulin receptors","ncbiTaxonId":9606}]